books = [{"title": "Война и мир", "auter": "Лев Толстой", "years": 1869}, #создаем список книг
         {"title": "Дом в котором", "auter": "Мариам Петросян", "years": 2009},
         {"title": "Гарри Поттер",  "auter": "Джуан Роулинг", "years": 1997},
         {"title": "Мастер и Маргарита", "auter": "Михаил Булгаков", "years": 1967},
         {"title": "Ночь в лиссабоне", "auter": "Эрих Ремарк", "years": 1962},
         {"title": "Триумфальная арка", "auter": "Эрих Ремарк", "years": 1965},
         {"title": "Чайка", "auter": "Антон Чехов", "years": 1895},]

for index in range(len(books)): #используем цикл для поочередного возвращения каждой строки из списка
    print(f" ------------------- Книга {index + 1} -------------------") #вывод номера книги
    print(f" Название: {books[index]["title"]}, Автор: {books[index]["auter"]},") #вывод названия и автора
    print(f" --------------------- {books[index]["years"]} ---------------------\n")#вывод года издания